# Data Extraction       -       Data Cleaning    -        Cleaned Data Export

### 1.1 NASDAQ - CSV - Tesla historical stock price

In [1]:
import pandas as pd
import numpy as np
import re
import requests
pd.set_option("display.max_columns", None)

In [2]:
df=pd.read_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project3_DA_Ironhack\Data\archive\HistoricalData_1656067143500.csv', encoding='latin1')

df

           Fecha Cerrar/Ãºltimo   Volumen     Abrir       Alto     Bajo
0     06/23/2022        $705.21  34734230  $713.715    $717.95  $685.91
1     06/22/2022        $708.26  33842420   $703.51     $740.5  $701.48
2     06/21/2022        $711.11  40930990   $673.81  $730.7321     $673
3     06/17/2022        $650.28  30880590    $640.3  $662.9082  $639.59
4     06/16/2022         $639.3  35796900   $668.21     $675.5  $626.08
...          ...            ...       ...       ...        ...      ...
2511  06/29/2012         $6.258   5628520     $6.56      $6.56     $6.2
2512  06/28/2012         $6.282   4570200     $6.38     $6.422   $6.124
2513  06/27/2012         $6.392   5235970     $6.38     $6.489   $6.314
2514  06/26/2012         $6.322  13069245     $6.41      $6.47   $6.278
2515  06/25/2012         $6.622   7475870    $6.788     $6.824    $6.55

[2516 rows x 6 columns]

In [3]:
df.shape

(2516, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2516 entries, 0 to 2515
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Fecha           2516 non-null   object
 1   Cerrar/Ãºltimo  2516 non-null   object
 2   Volumen         2516 non-null   int64
 3   Abrir           2516 non-null   object
 4   Alto            2516 non-null   object
 5   Bajo            2516 non-null   object
dtypes: int64(1), object(5)
memory usage: 118.1+ KB

In [5]:
df.columns=[c.lower().replace(' ', '_') for c in df.columns]
df.columns=[c.lower().replace('cerrar/ãºltimo', 'closing') for c in df.columns]
df.columns=[c.lower().replace('fecha', 'date') for c in df.columns]
df.columns=[c.lower().replace('volumen', 'volume') for c in df.columns]
df.columns=[c.lower().replace('abrir', 'opening') for c in df.columns]
df.columns=[c.lower().replace('alto', 'highest') for c in df.columns]
df.columns=[c.lower().replace('bajo', 'lowest') for c in df.columns]

In [6]:
df.columns

Index(['date', 'closing', 'volume', 'opening', 'highest', 'lowest'], dtype='object')

In [7]:
nan_cols=df.isnull().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

In [8]:
df.date=pd.to_datetime(df.date)

In [9]:
df['closing'].replace('$','',inplace=True)

In [10]:
df.closing=[e.replace('$', '') for e in df.closing]

In [11]:
df.opening=[e.replace('$', '') for e in df.opening]

In [12]:
df.highest=[e.replace('$', '') for e in df.highest]

In [13]:
df.lowest=[e.replace('$', '') for e in df.lowest]

In [14]:
df

           date closing    volume  opening   highest  lowest
0    2022-06-23  705.21  34734230  713.715    717.95  685.91
1    2022-06-22  708.26  33842420   703.51     740.5  701.48
2    2022-06-21  711.11  40930990   673.81  730.7321     673
3    2022-06-17  650.28  30880590    640.3  662.9082  639.59
4    2022-06-16   639.3  35796900   668.21     675.5  626.08
...         ...     ...       ...      ...       ...     ...
2511 2012-06-29   6.258   5628520     6.56      6.56     6.2
2512 2012-06-28   6.282   4570200     6.38     6.422   6.124
2513 2012-06-27   6.392   5235970     6.38     6.489   6.314
2514 2012-06-26   6.322  13069245     6.41      6.47   6.278
2515 2012-06-25   6.622   7475870    6.788     6.824    6.55

[2516 rows x 6 columns]

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2516 entries, 0 to 2515
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     2516 non-null   datetime64[ns]
 1   closing  2516 non-null   object
 2   volume   2516 non-null   int64
 3   opening  2516 non-null   object
 4   highest  2516 non-null   object
 5   lowest   2516 non-null   object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 118.1+ KB

In [16]:
df['closing'] = df['closing'].astype('float')
df['opening'] = df['opening'].astype('float')
df['highest'] = df['highest'].astype('float')
df['lowest'] = df['lowest'].astype('float')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2516 entries, 0 to 2515
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     2516 non-null   datetime64[ns]
 1   closing  2516 non-null   float64
 2   volume   2516 non-null   int64
 3   opening  2516 non-null   float64
 4   highest  2516 non-null   float64
 5   lowest   2516 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 118.1 KB

In [18]:
df['daily_movement']=df['closing']-df['opening']

In [19]:
df['year'] = pd.DatetimeIndex(df['date']).year

In [20]:
df['month'] = pd.DatetimeIndex(df['date']).month

In [21]:
df.head()

,date,closing,volume,opening,highest,lowest,daily_movement,year,month
0,2022-06-23,705.21,34734230,713.715,717.9500,685.91,-8.505,2022,6
1,2022-06-22,708.26,33842420,703.510,740.5000,701.48,4.750,2022,6
2,2022-06-21,711.11,40930990,673.810,730.7321,673.00,37.300,2022,6
3,2022-06-17,650.28,30880590,640.300,662.9082,639.59,9.980,2022,6
4,2022-06-16,639.30,35796900,668.210,675.5000,626.08,-28.910,2022,6

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2516 entries, 0 to 2515
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            2516 non-null   datetime64[ns]
 1   closing         2516 non-null   float64
 2   volume          2516 non-null   int64
 3   opening         2516 non-null   float64
 4   highest         2516 non-null   float64
 5   lowest          2516 non-null   float64
 6   daily_movement  2516 non-null   float64
 7   year            2516 non-null   int64
 8   month           2516 non-null   int64
dtypes: datetime64[ns](1), float64(5), int64(3)
memory usage: 177.0 KB

In [23]:
df.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project3_DA_Ironhack\Data\tesla_stock_price.csv', index=False)

In [95]:
df.shape

(2516, 9)

### 1.2 Kaggle - CSV - Elon Musk historical tweets

In [24]:
df2=pd.read_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project3_DA_Ironhack\Data\archive\elonmusk.csv', encoding='latin1')

df2.head()

,Tweet,UserScreenName,UserName,Timestamp,text,Emojis,Comments,Likes,Retweets,Image link,Tweet URL
0,0,Elon Musk,@elonmusk,2010-06-04T18:31:57.000Z,"Please ignore prior tweets, as that was someon...",NaN,873,648,"5,453",[],https://twitter.com/elonmusk/status/15434727182
1,1,Elon Musk,@elonmusk,2011-12-01T09:55:11.000Z,Went to Iceland on Sat to ride bumper cars on ...,NaN,30,24,188,['https://pbs.twimg.com/media/Afkf5DMCAAEJGFr?...,https://twitter.com/elonmusk/status/1421799282...
2,2,Elon Musk,@elonmusk,2011-12-01T10:29:04.000Z,I made the volume on the Model S http://ow.ly/...,NaN,29,17,78,[],https://twitter.com/elonmusk/status/1421884581...
3,3,Elon Musk,@elonmusk,2011-12-03T08:20:28.000Z,"Great Voltaire quote, arguably better than Twa...",NaN,23,30,44,[],https://twitter.com/elonmusk/status/1428808713...
4,4,Elon Musk,@elonmusk,2011-12-03T08:22:07.000Z,That was a total non sequitur btw\n26\n14\n50,NaN,26,14,50,[],https://twitter.com/elonmusk/status/1428812840...

In [25]:
df2.shape

(12206, 11)

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12206 entries, 0 to 12205
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Tweet           12206 non-null  int64
 1   UserScreenName  12206 non-null  object
 2   UserName        12206 non-null  object
 3   Timestamp       12206 non-null  object
 4   text            12206 non-null  object
 5   Emojis          854 non-null    object
 6   Comments        12186 non-null  object
 7   Likes           12183 non-null  object
 8   Retweets        12206 non-null  object
 9   Image link      12206 non-null  object
 10  Tweet URL       12206 non-null  object
dtypes: int64(1), object(10)
memory usage: 1.0+ MB

In [27]:
df2.columns=[c.lower().replace(' ', '_') for c in df2.columns]
df2.columns=[c.lower().replace('timestamp', 'post_time') for c in df2.columns]
df2.columns

Index(['tweet', 'userscreenname', 'username', 'post_time', 'text', 'emojis',
       'comments', 'likes', 'retweets', 'image_link', 'tweet_url'],
      dtype='object')

In [28]:
nan_cols=df2.isnull().sum()
nan_cols[nan_cols>0]

emojis      11352
comments       20
likes          23
dtype: int64

In [29]:
del df2['tweet']
del df2['emojis']

In [30]:
df2["comments"].fillna("0", inplace = True)
df2["likes"].fillna("0", inplace = True)

In [31]:
def time(col):
    
    res1=[]
    
    
    for e in col:
        res1.append(e[0:10])
        
    return res1

In [32]:
df2['n_post_time']=time(df2.post_time)
df2.head()

,userscreenname,username,post_time,text,comments,likes,retweets,image_link,tweet_url,n_post_time
0,Elon Musk,@elonmusk,2010-06-04T18:31:57.000Z,"Please ignore prior tweets, as that was someon...",873,648,"5,453",[],https://twitter.com/elonmusk/status/15434727182,2010-06-04
1,Elon Musk,@elonmusk,2011-12-01T09:55:11.000Z,Went to Iceland on Sat to ride bumper cars on ...,30,24,188,['https://pbs.twimg.com/media/Afkf5DMCAAEJGFr?...,https://twitter.com/elonmusk/status/1421799282...,2011-12-01
2,Elon Musk,@elonmusk,2011-12-01T10:29:04.000Z,I made the volume on the Model S http://ow.ly/...,29,17,78,[],https://twitter.com/elonmusk/status/1421884581...,2011-12-01
3,Elon Musk,@elonmusk,2011-12-03T08:20:28.000Z,"Great Voltaire quote, arguably better than Twa...",23,30,44,[],https://twitter.com/elonmusk/status/1428808713...,2011-12-03
4,Elon Musk,@elonmusk,2011-12-03T08:22:07.000Z,That was a total non sequitur btw\n26\n14\n50,26,14,50,[],https://twitter.com/elonmusk/status/1428812840...,2011-12-03

In [33]:
df2['n_post_time'] = pd.to_datetime(df2['n_post_time'])
del df2['post_time']

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12206 entries, 0 to 12205
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   userscreenname  12206 non-null  object
 1   username        12206 non-null  object
 2   text            12206 non-null  object
 3   comments        12206 non-null  object
 4   likes           12206 non-null  object
 5   retweets        12206 non-null  object
 6   image_link      12206 non-null  object
 7   tweet_url       12206 non-null  object
 8   n_post_time     12206 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(8)
memory usage: 858.4+ KB

In [35]:
df2.retweets=[c.lower().replace(',', '') for c in df2.retweets]
df2.comments=[c.lower().replace(',', '') for c in df2.comments]
df2.likes=[c.lower().replace(',', '') for c in df2.likes]

In [36]:
def exchange(col):
    
    res=[]
    
    number=1
    
    
    for e in col:
        if e[-1].isdigit():
            res.append(e)
            
        else:
        
            if e[-1]=='k':
                number=1e3
                n_col=re.findall('[0-9.]+', e)[0]
                res.append(int(float(n_col) * number))


            elif e[-1]=='K': 
                number=1e3
                n_col=re.findall('[0-9.]+', e)[0]
                res.append(int(float(n_col) * number))

            elif e[-1]=='M': 
                number=1e6
                n_col=re.findall('[0-9.]+', e)[0]
                res.append(int(float(n_col) * number))

            elif e[-1]=='m': 
                number=1e6
                n_col=re.findall('[0-9.]+', e)[0]
                res.append(int(float(n_col) * number))


            else:
                n_col=re.findall('[0-9.]+', e)[0]
                res.append(int(float(n_col) * number))
                   
    return res

In [37]:
exchange(['23333'])

['23333']

In [38]:
df2['n_retweets']=exchange(df2.retweets)

In [39]:
df2['n_comments']=exchange(df2.comments)

In [40]:
df2['n_likes']=exchange(df2.likes)

In [41]:
df2.head()

,userscreenname,username,text,comments,likes,retweets,image_link,tweet_url,n_post_time,n_retweets,n_comments,n_likes
0,Elon Musk,@elonmusk,"Please ignore prior tweets, as that was someon...",873,648,5453,[],https://twitter.com/elonmusk/status/15434727182,2010-06-04,5453,873,648
1,Elon Musk,@elonmusk,Went to Iceland on Sat to ride bumper cars on ...,30,24,188,['https://pbs.twimg.com/media/Afkf5DMCAAEJGFr?...,https://twitter.com/elonmusk/status/1421799282...,2011-12-01,188,30,24
2,Elon Musk,@elonmusk,I made the volume on the Model S http://ow.ly/...,29,17,78,[],https://twitter.com/elonmusk/status/1421884581...,2011-12-01,78,29,17
3,Elon Musk,@elonmusk,"Great Voltaire quote, arguably better than Twa...",23,30,44,[],https://twitter.com/elonmusk/status/1428808713...,2011-12-03,44,23,30
4,Elon Musk,@elonmusk,That was a total non sequitur btw\n26\n14\n50,26,14,50,[],https://twitter.com/elonmusk/status/1428812840...,2011-12-03,50,26,14

In [42]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12206 entries, 0 to 12205
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   userscreenname  12206 non-null  object
 1   username        12206 non-null  object
 2   text            12206 non-null  object
 3   comments        12206 non-null  object
 4   likes           12206 non-null  object
 5   retweets        12206 non-null  object
 6   image_link      12206 non-null  object
 7   tweet_url       12206 non-null  object
 8   n_post_time     12206 non-null  datetime64[ns]
 9   n_retweets      12206 non-null  object
 10  n_comments      12206 non-null  object
 11  n_likes         12206 non-null  object
dtypes: datetime64[ns](1), object(11)
memory usage: 1.1+ MB

In [43]:
del df2['likes']
del df2['comments']
del df2['retweets']

In [44]:
df2['n_likes'] = df2['n_likes'].astype('int')

In [45]:
df2['n_comments'] = df2['n_comments'].astype('int')

In [46]:
df2['n_retweets'] = df2['n_retweets'].astype('int')

In [47]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12206 entries, 0 to 12205
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   userscreenname  12206 non-null  object
 1   username        12206 non-null  object
 2   text            12206 non-null  object
 3   image_link      12206 non-null  object
 4   tweet_url       12206 non-null  object
 5   n_post_time     12206 non-null  datetime64[ns]
 6   n_retweets      12206 non-null  int32
 7   n_comments      12206 non-null  int32
 8   n_likes         12206 non-null  int32
dtypes: datetime64[ns](1), int32(3), object(5)
memory usage: 715.3+ KB

In [48]:
df2['year'] = pd.DatetimeIndex(df2['n_post_time']).year

In [49]:
df2['month'] = pd.DatetimeIndex(df2['n_post_time']).month

In [50]:
df2.columns=[c.lower().replace('n_post_time', 'date') for c in df2.columns]
df2.columns=[c.lower().replace('n_comments', 'comments') for c in df2.columns]
df2.columns=[c.lower().replace('n_likes', 'likes') for c in df2.columns]
df2.columns=[c.lower().replace('n_retweets', 'retweets') for c in df2.columns]

In [51]:
df2.head()

,userscreenname,username,text,image_link,tweet_url,date,retweets,comments,likes,year,month
0,Elon Musk,@elonmusk,"Please ignore prior tweets, as that was someon...",[],https://twitter.com/elonmusk/status/15434727182,2010-06-04,5453,873,648,2010,6
1,Elon Musk,@elonmusk,Went to Iceland on Sat to ride bumper cars on ...,['https://pbs.twimg.com/media/Afkf5DMCAAEJGFr?...,https://twitter.com/elonmusk/status/1421799282...,2011-12-01,188,30,24,2011,12
2,Elon Musk,@elonmusk,I made the volume on the Model S http://ow.ly/...,[],https://twitter.com/elonmusk/status/1421884581...,2011-12-01,78,29,17,2011,12
3,Elon Musk,@elonmusk,"Great Voltaire quote, arguably better than Twa...",[],https://twitter.com/elonmusk/status/1428808713...,2011-12-03,44,23,30,2011,12
4,Elon Musk,@elonmusk,That was a total non sequitur btw\n26\n14\n50,[],https://twitter.com/elonmusk/status/1428812840...,2011-12-03,50,26,14,2011,12

In [102]:
df2.text[0]

'Please ignore prior tweets, as that was someone pretending to be me :)  This is actually me.\n873\n648\n5,453'

In [52]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12206 entries, 0 to 12205
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   userscreenname  12206 non-null  object
 1   username        12206 non-null  object
 2   text            12206 non-null  object
 3   image_link      12206 non-null  object
 4   tweet_url       12206 non-null  object
 5   date            12206 non-null  datetime64[ns]
 6   retweets        12206 non-null  int32
 7   comments        12206 non-null  int32
 8   likes           12206 non-null  int32
 9   year            12206 non-null  int64
 10  month           12206 non-null  int64
dtypes: datetime64[ns](1), int32(3), int64(2), object(5)
memory usage: 906.0+ KB

In [96]:
df2.shape

(12206, 11)

In [100]:
df2.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project3_DA_Ironhack\Data\elon_musk_tweets.csv', index=False, sep=',')

### 1.3 BeautifulSoup Scraping - Timeline for Tesla

In [75]:
import requests as req

from bs4 import BeautifulSoup as bs

import pandas as pd

In [76]:
url='https://ir.tesla.com/press?page='

In [77]:
html=req.get(url).content
sopa=bs(html, 'html.parser')

In [78]:
todos_elementos=sopa.find('div', class_='views-element-container')

In [79]:
len(todos_elementos)

2

In [80]:
fecha=todos_elementos.find('time', datetime='2022-04-20T12:00:00Z').text.strip()

header=todos_elementos.find('h4', class_='press-release-teaser__title').text.strip()

cuerpo=todos_elementos.find('div', class_='press-release-teaser__body tds-text--body').text.strip()

In [81]:
{'fecha': fecha,
'header': header,
'cuerpo': cuerpo}

{'fecha': 'Apr 20, 2022',
 'header': 'Tesla Releases First Quarter 2022 Financial Results',
 'cuerpo': 'AUSTIN, Texas, April 20, 2022 – Tesla has released its financial results for the first quarter of 2022 by posting an update on its Investor Relations website. Please visit https://ir.tesla.com to view the update.\n\n\nContinue Reading'}

In [82]:
url = "https://ir.tesla.com/press?page="

data=[] 

for u in range(0, 110):
    for e in sopa.find('div', class_='views-element-container').find_all('div', class_='views-row'):
        r = req.get(url + str(u))
        sopa = bs(r.content, "html.parser")
        fecha=e.find('time').text.strip()
        header=e.find('h4', class_='press-release-teaser__title').text.strip()
        cuerpo=e.find('div', class_='press-release-teaser__body tds-text--body').text.strip()

        data.append({'fecha': fecha,
                                     'header': header,
                                     'cuerpo': cuerpo})
data2=pd.DataFrame(data)
data2

,fecha,header,cuerpo
0,"Apr 20, 2022",Tesla Releases First Quarter 2022 Financial Re...,"AUSTIN, Texas, April 20, 2022 – Tesla has rele..."
1,"Apr 2, 2022",Tesla Vehicle Production & Deliveries and Date...,"Austin, Texas, April 2, 2022 – In the first qu..."
2,"Jan 26, 2022",Tesla Releases Fourth Quarter and Full Year 20...,"AUSTIN, Texas, January 26, 2022 – Tesla has re..."
3,"Jan 12, 2022",Tesla Announces Date for Fourth Quarter and Fu...,"AUSTIN, Texas, January 12, 2022 – Tesla will p..."
4,"Jan 2, 2022",Tesla Q4 2021 Vehicle Production & Deliveries,"AUSTIN, Texas, January 2, 2022 – In the fourth..."
...,...,...,...
543,"Apr 8, 2008",Tesla Motors Initiates European Sales,Tesla Motors Initiates European Sales\n\nEurop...
544,"Mar 23, 2008",Tesla Motors Speaks Out Against CARB Proposal ...,Tesla Motors Speaks Out Against CARB Proposal ...
545,"Mar 16, 2008",Tesla Motors Begins Regular Production of 2008...,Tesla Motors Begins Regular Production of 2008...
546,"Jan 22, 2008",Tesla Motors Completes all Regulatory Approval...,Tesla Motors Completes all Regulatory Approval...
547,"Nov 6, 2007",Tesla Motors Completes CEO Search,Tesla Motors Completes CEO Search A Message fr...

In [83]:
data2.fecha=pd.to_datetime(data2.fecha)

In [84]:
data2

,fecha,header,cuerpo
0,2022-04-20,Tesla Releases First Quarter 2022 Financial Re...,"AUSTIN, Texas, April 20, 2022 – Tesla has rele..."
1,2022-04-02,Tesla Vehicle Production & Deliveries and Date...,"Austin, Texas, April 2, 2022 – In the first qu..."
2,2022-01-26,Tesla Releases Fourth Quarter and Full Year 20...,"AUSTIN, Texas, January 26, 2022 – Tesla has re..."
3,2022-01-12,Tesla Announces Date for Fourth Quarter and Fu...,"AUSTIN, Texas, January 12, 2022 – Tesla will p..."
4,2022-01-02,Tesla Q4 2021 Vehicle Production & Deliveries,"AUSTIN, Texas, January 2, 2022 – In the fourth..."
...,...,...,...
543,2008-04-08,Tesla Motors Initiates European Sales,Tesla Motors Initiates European Sales\n\nEurop...
544,2008-03-23,Tesla Motors Speaks Out Against CARB Proposal ...,Tesla Motors Speaks Out Against CARB Proposal ...
545,2008-03-16,Tesla Motors Begins Regular Production of 2008...,Tesla Motors Begins Regular Production of 2008...
546,2008-01-22,Tesla Motors Completes all Regulatory Approval...,Tesla Motors Completes all Regulatory Approval...
547,2007-11-06,Tesla Motors Completes CEO Search,Tesla Motors Completes CEO Search A Message fr...

In [85]:
data2.columns=[c.lower().replace('fecha', 'date') for c in data2.columns]
data2.columns=[c.lower().replace('cuerpo', 'body') for c in data2.columns]

In [86]:
data2

,date,header,body
0,2022-04-20,Tesla Releases First Quarter 2022 Financial Re...,"AUSTIN, Texas, April 20, 2022 – Tesla has rele..."
1,2022-04-02,Tesla Vehicle Production & Deliveries and Date...,"Austin, Texas, April 2, 2022 – In the first qu..."
2,2022-01-26,Tesla Releases Fourth Quarter and Full Year 20...,"AUSTIN, Texas, January 26, 2022 – Tesla has re..."
3,2022-01-12,Tesla Announces Date for Fourth Quarter and Fu...,"AUSTIN, Texas, January 12, 2022 – Tesla will p..."
4,2022-01-02,Tesla Q4 2021 Vehicle Production & Deliveries,"AUSTIN, Texas, January 2, 2022 – In the fourth..."
...,...,...,...
543,2008-04-08,Tesla Motors Initiates European Sales,Tesla Motors Initiates European Sales\n\nEurop...
544,2008-03-23,Tesla Motors Speaks Out Against CARB Proposal ...,Tesla Motors Speaks Out Against CARB Proposal ...
545,2008-03-16,Tesla Motors Begins Regular Production of 2008...,Tesla Motors Begins Regular Production of 2008...
546,2008-01-22,Tesla Motors Completes all Regulatory Approval...,Tesla Motors Completes all Regulatory Approval...
547,2007-11-06,Tesla Motors Completes CEO Search,Tesla Motors Completes CEO Search A Message fr...

In [87]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 548 entries, 0 to 547
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    548 non-null    datetime64[ns]
 1   header  548 non-null    object
 2   body    548 non-null    object
dtypes: datetime64[ns](1), object(2)
memory usage: 13.0+ KB

In [88]:
data2['year'] = pd.DatetimeIndex(data2['date']).year

In [89]:
data2['month'] = pd.DatetimeIndex(data2['date']).month

In [90]:
data2.head()

,date,header,body,year,month
0,2022-04-20,Tesla Releases First Quarter 2022 Financial Re...,"AUSTIN, Texas, April 20, 2022 – Tesla has rele...",2022,4
1,2022-04-02,Tesla Vehicle Production & Deliveries and Date...,"Austin, Texas, April 2, 2022 – In the first qu...",2022,4
2,2022-01-26,Tesla Releases Fourth Quarter and Full Year 20...,"AUSTIN, Texas, January 26, 2022 – Tesla has re...",2022,1
3,2022-01-12,Tesla Announces Date for Fourth Quarter and Fu...,"AUSTIN, Texas, January 12, 2022 – Tesla will p...",2022,1
4,2022-01-02,Tesla Q4 2021 Vehicle Production & Deliveries,"AUSTIN, Texas, January 2, 2022 – In the fourth...",2022,1

In [91]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 548 entries, 0 to 547
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    548 non-null    datetime64[ns]
 1   header  548 non-null    object
 2   body    548 non-null    object
 3   year    548 non-null    int64
 4   month   548 non-null    int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 21.5+ KB

In [92]:
data2.date.value_counts()

2015-11-03    3
2010-05-18    3
2014-11-05    3
2015-04-22    3
2013-05-06    3
             ..
2015-08-12    1
2015-08-21    1
2015-09-02    1
2015-09-09    1
2007-11-06    1
Name: date, Length: 488, dtype: int64

In [93]:
data2.to_csv(r'C:\Users\alexd\Ironhack\Proyectos\Project3_DA_Ironhack\Data\tesla_news.csv', index=False)

In [97]:
data2.shape

(548, 5)

In [134]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\alexd\downloads\descargaanaconda\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [135]:
from sqlalchemy import create_engine

In [136]:
str_conn='mysql+pymysql://root:password@localhost:3306/project3'

cursor=create_engine(str_conn)

In [137]:
data2.to_sql(name='tesla_news', con=cursor, if_exists='replace', index=False)

In [138]:
df2.to_sql(name='elon_musk_tweets', con=cursor, if_exists='replace', index=False)

In [ ]:
data2.to_sql(name='tesla_news', con=cursor, if_exists='replace', index=False)